Revit 2027 API
BuiltInFailures.FormFailures.OpenProfileMultiSegmentSweepsNotSupported Property
 An open profile cannot be swept along a multi-segment path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenProfileMultiSegmentSweepsNotSupported { get; }
Public Shared ReadOnly Property OpenProfileMultiSegmentSweepsNotSupported As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenProfileMultiSegmentSweepsNotSupported {
	FailureDefinitionId^ get ();
}
static member OpenProfileMultiSegmentSweepsNotSupported : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace